In [1]:
import numpy as np
import pandas as pd

In [2]:
serie = pd.Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])
serie.a

np.int64(1)

In [3]:
dataframe = pd.DataFrame(np.arange(16).reshape(4,4), index = ['f1', 'f2', 'f3', 'f4'], columns = ['c1', 'c2', 'c3', 'c4'])
dataframe.c1

f1     0
f2     4
f3     8
f4    12
Name: c1, dtype: int64

In [4]:
indexación = pd.DataFrame({'Tipo':['obj[num_val]', 'obj[key]', 'obj[num_val1:num_val2]','obj[key1:key2]', 'obj[[num_val1,..,num_valn]]', 'obj[[key1,...,keyn]]', 'obj[[condition]]'],
                           'En Series':[ 'Selección por posición (salvo si el índice es numérico)', 'Selección por clave', 'Selección por posición (salvo si el índice es numérico)', 'Selección por clave', 'Selección por posición (salvo si el índice es numérico)', 'Selección por clave', ' Selección por estructura booleana'],
                          'En DataFrames': ['Selección por clave de columna', 'Selección por clave de columna', 'Selección por posición de fila (salvo si el índice de filas es numérico)', 'Selección por clave de fila','Selección por posición de columna', 'Selección por clave de columna', 'Selección por estructura booleana']})
indexación

,Tipo,En Series,En DataFrames
0,obj[num_val],Selección por posición (salvo si el índice es ...,Selección por clave de columna
1,obj[key],Selección por clave,Selección por clave de columna
2,obj[num_val1:num_val2],Selección por posición (salvo si el índice es ...,Selección por posición de fila (salvo si el ín...
3,obj[key1:key2],Selección por clave,Selección por clave de fila
4,"obj[[num_val1,..,num_valn]]",Selección por posición (salvo si el índice es ...,Selección por posición de columna
5,"obj[[key1,...,keyn]]",Selección por clave,Selección por clave de columna
6,obj[[condition]],Selección por estructura booleana,Selección por estructura booleana

In [5]:
serie

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
serie[3]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_11272\374135576.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  serie[3]

np.int64(4)

In [7]:
serie['a']

np.int64(1)

In [8]:
serie[1:4]

b    2
c    3
d    4
dtype: int64

In [9]:
serie['a':'c']

a    1
b    2
c    3
dtype: int64

In [10]:
serie[[1, 3]]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_11272\1677208103.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  serie[[1, 3]]

b    2
d    4
dtype: int64

In [11]:
serie[['a','c']]

a    1
c    3
dtype: int64

In [12]:
serie[[True, True, False, True]]

a    1
b    2
d    4
dtype: int64

In [13]:
dataframe

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [14]:
dataframe['c3']

f1     2
f2     6
f3    10
f4    14
Name: c3, dtype: int64

In [15]:
dataframe['f1': 'f3']

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11

In [16]:
dataframe[0:3]

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11

In [17]:
dataframe[['c1', 'c3']]

    c1  c3
f1   0   2
f2   4   6
f3   8  10
f4  12  14

In [18]:
indexación_por_clave = pd.DataFrame({'Tipo': ['obj.loc[key]', 'obj.loc[key1:key2]', 'obj.loc[[key1,..,keyn]]', 'obj.loc[[condition]]', 'obj.loc[set1,set2]'],
                                    'En Series': ['Selección por clave', 'Selección por clave', 'Selección por clave', 'Selección por estructura booleana', 'ERROR'],
                                    'En DataFrames': ['Selección por clave de filas', 'Selección por clave de filas', 'Selección por clave de filas', 'Selección por estructuras booleana sobre filas', 'Selección por clave de fila (set1) y columna (set2). Selectores: clave, slice, secuencia o condición']})
indexación_por_clave

,Tipo,En Series,En DataFrames
0,obj.loc[key],Selección por clave,Selección por clave de filas
1,obj.loc[key1:key2],Selección por clave,Selección por clave de filas
2,"obj.loc[[key1,..,keyn]]",Selección por clave,Selección por clave de filas
3,obj.loc[[condition]],Selección por estructura booleana,Selección por estructuras booleana sobre filas
4,"obj.loc[set1,set2]",ERROR,Selección por clave de fila (set1) y columna (...

In [19]:
serie

a    1
b    2
c    3
d    4
dtype: int64

In [20]:
serie.loc['c']

np.int64(3)

In [21]:
serie.loc['a':'c']

a    1
b    2
c    3
dtype: int64

In [22]:
serie.loc[['b','d']]

b    2
d    4
dtype: int64

In [23]:
serie.loc[[True, False, True, False]]

a    1
c    3
dtype: int64

In [24]:
dataframe

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [25]:
dataframe.loc['f4']

c1    12
c2    13
c3    14
c4    15
Name: f4, dtype: int64

In [26]:
dataframe.loc['f2':'f4']

    c1  c2  c3  c4
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [27]:
dataframe.loc[['f1', 'f3']]

    c1  c2  c3  c4
f1   0   1   2   3
f3   8   9  10  11

In [28]:
dataframe.loc[[True, False, False, True]]

    c1  c2  c3  c4
f1   0   1   2   3
f4  12  13  14  15

In [29]:
dataframe.loc['f3','c2']

np.int64(9)

In [30]:
dataframe.loc['f2',:]

c1    4
c2    5
c3    6
c4    7
Name: f2, dtype: int64

In [31]:
dataframe.loc[:,'c3']

f1     2
f2     6
f3    10
f4    14
Name: c3, dtype: int64

In [32]:
dataframe.loc[:,:]

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [33]:
indexación_por_índices = pd.DataFrame({'Tipo': ['obj.iloc[num_val]', 'obj.iloc[num_val1:num_val2]', 'obj.loc[[num_val1,..,num_valn]', 'obj.loc[set1,set2]'],
                                      'En Series': ['Selección por posición', 'Selección por posición', 'Selección por posición', 'ERROR'],
                                      'En DataFrames': ['Selección por filas', 'Selección por filas', 'Selección por filas', 'Selección por clave de fila (set1) y columna (set2), Selectores: posición, slice o secuencia']})
indexación_por_índices

,Tipo,En Series,En DataFrames
0,obj.iloc[num_val],Selección por posición,Selección por filas
1,obj.iloc[num_val1:num_val2],Selección por posición,Selección por filas
2,"obj.loc[[num_val1,..,num_valn]",Selección por posición,Selección por filas
3,"obj.loc[set1,set2]",ERROR,Selección por clave de fila (set1) y columna (...

In [34]:
serie

a    1
b    2
c    3
d    4
dtype: int64

In [35]:
serie.iloc[2]

np.int64(3)

In [36]:
serie.iloc[1:3]

b    2
c    3
dtype: int64

In [37]:
serie.iloc[[1, 3]]

b    2
d    4
dtype: int64

In [38]:
dataframe

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [39]:
dataframe.iloc[2]

c1     8
c2     9
c3    10
c4    11
Name: f3, dtype: int64

In [40]:
dataframe.iloc[0:3]

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11

In [41]:
dataframe.iloc[[1, 3]]

    c1  c2  c3  c4
f2   4   5   6   7
f4  12  13  14  15

In [42]:
dataframe.iloc[3, :]

c1    12
c2    13
c3    14
c4    15
Name: f4, dtype: int64

In [43]:
dataframe.iloc[:, 2]

f1     2
f2     6
f3    10
f4    14
Name: c3, dtype: int64

In [44]:
dataframe.iloc[:,:]

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [45]:
peliculas = pd.DataFrame(
            {'Valoración': [6, None, 8.75, None],
             'Presupuesto': [160, 250, 100, None],
             'Director': ['Peter Jackson', 'Gareth Edwards', 'Martin Scorsese', 'Alfonso Cuarón']},
            index = [[2014, 2014, 2013, 2013], ['Godzilla', 'El Hobbit III', 'El lobo de Wall Street', 'Gravity']])
peliculas

                             Valoración  Presupuesto         Director
2014 Godzilla                      6.00        160.0    Peter Jackson
     El Hobbit III                  NaN        250.0   Gareth Edwards
2013 El lobo de Wall Street        8.75        100.0  Martin Scorsese
     Gravity                        NaN          NaN   Alfonso Cuarón

In [46]:
# Indexación total
peliculas.loc[(2014, 'Godzilla')]

Valoración               6.0
Presupuesto            160.0
Director       Peter Jackson
Name: (2014, Godzilla), dtype: object

In [47]:
#Indexación parcial
peliculas.loc[2014]

               Valoración  Presupuesto        Director
Godzilla              6.0        160.0   Peter Jackson
El Hobbit III         NaN        250.0  Gareth Edwards

In [48]:
# Pasamos el último nivel del índice de filas al de columnas
peliculas_2 = peliculas.unstack()
peliculas_2

        Valoración                                           Presupuesto  \
     El Hobbit III El lobo de Wall Street Godzilla Gravity El Hobbit III
2013           NaN                   8.75      NaN     NaN           NaN
2014           NaN                    NaN      6.0     NaN         250.0

                                                    Director  \
     El lobo de Wall Street Godzilla Gravity   El Hobbit III
2013                  100.0      NaN     NaN             NaN
2014                    NaN    160.0     NaN  Gareth Edwards


     El lobo de Wall Street       Godzilla         Gravity
2013        Martin Scorsese            NaN  Alfonso Cuarón
2014                    NaN  Peter Jackson             NaN

In [49]:
# Pasamos el último nivel del índice de columnas al de filas
peliculas.stack()

2014  Godzilla                Valoración                 6.0
                              Presupuesto              160.0
                              Director         Peter Jackson
      El Hobbit III           Presupuesto              250.0
                              Director        Gareth Edwards
2013  El lobo de Wall Street  Valoración                8.75
                              Presupuesto              100.0
                              Director       Martin Scorsese
      Gravity                 Director        Alfonso Cuarón
dtype: object

In [50]:
peliculas_2.stack()

C:\Users\ASUS\AppData\Local\Temp\ipykernel_11272\3959461335.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  peliculas_2.stack()

                             Valoración  Presupuesto         Director
2013 El lobo de Wall Street        8.75        100.0  Martin Scorsese
     Gravity                        NaN          NaN   Alfonso Cuarón
2014 El Hobbit III                  NaN        250.0   Gareth Edwards
     Godzilla                      6.00        160.0    Peter Jackson

In [51]:
serie = pd.Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])
serie

a    1
b    2
c    3
d    4
dtype: int64

In [52]:
dataframe = pd.DataFrame(np.arange(16).reshape(4,4), index = ['f1', 'f2', 'f3', 'f4'], columns = ['c1', 'c2', 'c3', 'c4'])
dataframe

    c1  c2  c3  c4
f1   0   1   2   3
f2   4   5   6   7
f3   8   9  10  11
f4  12  13  14  15

In [53]:
# Reordenación del índice de una Serie
serie.reindex(['d', 'a', 'b', 'c'])  # Todo en orden inverso

d    4
a    1
b    2
c    3
dtype: int64

In [54]:
# Adición de etiquetas a un índice de una serie
serie.reindex(['a', 'c', 'e', 'd', 'b'])

a    1.0
c    3.0
e    NaN
d    4.0
b    2.0
dtype: float64

In [55]:
# Adición de etiquetas con valor de relleno a un índice de una serie
serie.reindex(['a', 'n', 'b', 'd', 'c'], fill_value = 0)

a    1
n    0
b    2
d    4
c    3
dtype: int64

In [56]:
# Selección de índice de filas de un DataFrame
dataframe.reindex(['f3', 'f1'])

    c1  c2  c3  c4
f3   8   9  10  11
f1   0   1   2   3

In [57]:
# Adición de etiquetas al índice de filas de un DataFrame
dataframe.reindex(['f1', 'f3', 'f6'])

     c1   c2    c3    c4
f1  0.0  1.0   2.0   3.0
f3  8.0  9.0  10.0  11.0
f6  NaN  NaN   NaN   NaN

In [58]:
# Adición de etiquetas al índice de filas de un DataFrame con método de relleno
dataframe.reindex(['f1', 'f3', 'f10'], method = 'ffill')

     c1  c2  c3  c4
f1    0   1   2   3
f3    8   9  10  11
f10   0   1   2   3

In [59]:
# Adición de etiquetas al índice de filas de un DataFrame con método de relleno
dataframe.reindex(['f1', 'f3', 'f10'], method = 'bfill')

     c1  c2  c3  c4
f1    0   1   2   3
f3    8   9  10  11
f10   4   5   6   7

In [60]:
# Adición de etiquetas al índice de filas de un DataFrame con método de relleno
dataframe.reindex(['f1', 'f3', 'f10'], fill_value = 0)

     c1  c2  c3  c4
f1    0   1   2   3
f3    8   9  10  11
f10   0   0   0   0

In [61]:
# Modificación del índice de columnas de un DataFrame
dataframe.reindex(columns=['c1', 'c3', 'c2'])

    c1  c3  c2
f1   0   2   1
f2   4   6   5
f3   8  10   9
f4  12  14  13

In [62]:
dataframe_1 = dataframe.reset_index()
dataframe_1

  index  c1  c2  c3  c4
0    f1   0   1   2   3
1    f2   4   5   6   7
2    f3   8   9  10  11
3    f4  12  13  14  15

In [63]:
# Cambiando el nombre de las columnas
dataframe_1.columns = ['c1', 'c2','c3','c4','c5']
dataframe_1

   c1  c2  c3  c4  c5
0  f1   0   1   2   3
1  f2   4   5   6   7
2  f3   8   9  10  11
3  f4  12  13  14  15

In [64]:
dataframe.set_index(['c1'])

    c2  c3  c4
c1
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15